In [4]:
# 1. Tạo DataFrame employees chứa danh sách các nhân viên. Danh sách này được đọc từ tập tin employees.xls
# 2. Xem các thông tin của employees và xem 5 nhân viên đầu tiên.

import numpy as np
import pandas as pd

df_employee = pd.read_excel('employees.xlsx')
print(df_employee.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
EMPLOYEE_ID       107 non-null int64
FIRST_NAME        107 non-null object
LAST_NAME         107 non-null object
EMAIL             107 non-null object
PHONE_NUMBER      107 non-null object
HIRE_DATE         107 non-null object
JOB_ID            107 non-null object
SALARY            107 non-null int64
COMMISSION_PCT    35 non-null float64
MANAGER_ID        106 non-null float64
DEPARTMENT_ID     106 non-null float64
dtypes: float64(3), int64(2), object(6)
memory usage: 9.3+ KB
None

In [28]:
df_employee.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,2003-06-17 00:00:00,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21 00:00:00,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13 00:00:00,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03 00:00:00,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21 00:00:00,IT_PROG,6000,NaN,103.0,60.0

In [6]:
# 3. Tạo các DataFrame departments chứa danh sách các nhân viên và jobs chứa danh sách các công việc. Các danh sách này được đọc từ các tập tin departments.xls và job.xls

df_dep = pd.read_excel('departments.xlsx')
df_jobs = pd.read_excel('jobs.xlsx')
print(df_dep.head())
print(df_jobs.head())

   DEPARTMENT_ID  DEPARTMENT_NAME  MANAGER_ID  LOCATION_ID
0             10   Administration       200.0         1700
1             20        Marketing       201.0         1800
2             30       Purchasing       114.0         1700
3             40  Human Resources       203.0         2400
4             50         Shipping       121.0         1500
       JOB_ID                      JOB_TITLE  MIN_SALARY  MAX_SALARY
0  AC_ACCOUNT              Public Accountant        4200        9000
1      AC_MGR             Accounting Manager        8200       16000
2     AD_ASST       Administration Assistant        3000        6000
3     AD_PRES                      President       20080       40000
4       AD_VP  Administration Vice President       15000       30000

In [7]:
# 4. Tạo DataFrame emp là danh sách các nhân viên của DataFrame employees chỉ với các cột theo mẫu sau:

emp = pd.DataFrame(df_employee, columns = ['EMPLOYEE_ID','FIRST_NAME','LAST_NAME','HIRE_DATE','SALARY','DEPARTMENT_ID','JOB_ID'])
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID
0,100,Steven,King,2003-06-17 00:00:00,24000,90.0,AD_PRES
1,101,Neena,Kochhar,2005-09-21 00:00:00,17000,90.0,AD_VP
2,102,Lex,De Haan,2001-01-13 00:00:00,17000,90.0,AD_VP
3,103,Alexander,Hunold,2006-01-03 00:00:00,9000,60.0,IT_PROG
4,104,Bruce,Ernst,2007-05-21 00:00:00,6000,60.0,IT_PROG

In [9]:
# 5. Trong DataFrame emp hãy thêm vào hai cột: DEPARTMENT_NAME (tên phòng) và JOB_TITLE (tên công việc) theo mẫu sau:

emp = pd.merge(emp, df_dep[['DEPARTMENT_ID','DEPARTMENT_NAME']] , how="left")
emp = pd.merge(emp, df_jobs[['JOB_ID','JOB_TITLE']],  how="left")
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
0,100,Steven,King,2003-06-17 00:00:00,24000,90.0,AD_PRES,Executive,President
1,101,Neena,Kochhar,2005-09-21 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
2,102,Lex,De Haan,2001-01-13 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
3,103,Alexander,Hunold,2006-01-03 00:00:00,9000,60.0,IT_PROG,IT,Programmer
4,104,Bruce,Ernst,2007-05-21 00:00:00,6000,60.0,IT_PROG,IT,Programmer

In [10]:
# 6.Liệt kê các nhân viên của các phòng 50 và 90, sắp giảm theo department_id và tăng theo salary.

emp[(emp['DEPARTMENT_ID']==90) | (emp['DEPARTMENT_ID']==50)].sort_values(by=['DEPARTMENT_ID','SALARY'], ascending=[False,True]).set_index('EMPLOYEE_ID').head()

,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
EMPLOYEE_ID,,,,,,,,
101,Neena,Kochhar,2005-09-21 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
102,Lex,De Haan,2001-01-13 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
100,Steven,King,2003-06-17 00:00:00,24000,90.0,AD_PRES,Executive,President
132,TJ,Olson,2007-04-10 00:00:00,2100,50.0,ST_CLERK,Shipping,Stock Clerk
128,Steven,Markle,2008-03-08 00:00:00,2200,50.0,ST_CLERK,Shipping,Stock Clerk

In [11]:
# 7.Liệt kê các nhân viên của phòng có department_name là Sales và có salary>=5000 và salary<=7000

emp[(emp['DEPARTMENT_NAME']=='Sales') & (emp['SALARY']>=5000) & (emp['SALARY']<=7000)].head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
55,155,Oliver,Tuvault,2007-11-23 00:00:00,7000,80.0,SA_REP,Sales,Sales Representative
61,161,Sarath,Sewall,2006-11-03 00:00:00,7000,80.0,SA_REP,Sales,Sales Representative
65,165,David,Lee,2008-02-23 00:00:00,6800,80.0,SA_REP,Sales,Sales Representative
66,166,Sundar,Ande,2008-03-24 00:00:00,6400,80.0,SA_REP,Sales,Sales Representative
67,167,Amit,Banda,2008-04-21 00:00:00,6200,80.0,SA_REP,Sales,Sales Representative

In [ ]:
# 8 Cho biết phòng nào có tổng lương lớn nhất

In [71]:
emp.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
0,100,Steven,King,2003-06-17 00:00:00,24000,90.0,AD_PRES,Executive,President
1,101,Neena,Kochhar,2005-09-21 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
2,102,Lex,De Haan,2001-01-13 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
3,103,Alexander,Hunold,2006-01-03 00:00:00,9000,60.0,IT_PROG,IT,Programmer
4,104,Bruce,Ernst,2007-05-21 00:00:00,6000,60.0,IT_PROG,IT,Programmer

In [13]:
# 9 Cho biết nhân viên không thuộc phòng ban nào cả

emp[emp['DEPARTMENT_NAME'].isnull()]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
78,178,Kimberely,Grant,2007-05-24 00:00:00,7000,NaN,SA_REP,NaN,Sales Representative

In [15]:
# 10 In thông tin thống kê của salary

emp['SALARY'].describe()

count      107.000000
mean      6461.831776
std       3909.579731
min       2100.000000
25%       3100.000000
50%       6200.000000
75%       8900.000000
max      24000.000000
Name: SALARY, dtype: float64

In [20]:
# 11 Liệt kê các nhân viên có lương (salary) > trung bình các lương, sắp tăng theodepartment_name và sắp giảm theo salary

emp[emp['SALARY'] > emp['SALARY'].mean()].sort_values(by=['DEPARTMENT_NAME','SALARY'], ascending=[True,False]).reset_index(drop=True).head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,HIRE_DATE,SALARY,DEPARTMENT_ID,JOB_ID,DEPARTMENT_NAME,JOB_TITLE
0,205,Shelley,Higgins,2002-06-07 00:00:00,12008,110.0,AC_MGR,Accounting,Accounting Manager
1,206,William,Gietz,2002-06-07 00:00:00,8300,110.0,AC_ACCOUNT,Accounting,Public Accountant
2,100,Steven,King,2003-06-17 00:00:00,24000,90.0,AD_PRES,Executive,President
3,101,Neena,Kochhar,2005-09-21 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
4,102,Lex,De Haan,2001-01-13 00:00:00,17000,90.0,AD_VP,Executive,Administration Vice President
5,108,Nancy,Greenberg,2002-08-17 00:00:00,12008,100.0,FI_MGR,Finance,Finance Manager
6,109,Daniel,Faviet,2002-08-16 00:00:00,9000,100.0,FI_ACCOUNT,Finance,Accountant
7,110,John,Chen,2005-09-28 00:00:00,8200,100.0,FI_ACCOUNT,Finance,Accountant
8,112,Jose Manuel,Urman,2006-03-07 00:00:00,7800,100.0,FI_ACCOUNT,Finance,Accountant
9,111,Ismael,Sciarra,2005-09-30 00:00:00,7700,100.0,FI_ACCOUNT,Finance,Accountant